Peetselectronics/CMOS-6502-emulator-for-STM32f103c8/main.c
/* Includes ------------------------------------------------------------------*/
#include "stm32f10x_rcc.h"
#include "stm32f10x_usart.h"
#include "stm32f10x_gpio.h"
#include "stm32f10x_flash.h"
#include "misc.h"
#include "bios.h"
#include "main.h"

//usart
#define NUM 10
int i,j;
uint8_t a;
char name[NUM+1] = {'\0'};
ErrorStatus HSEStartUpStatus;
//char memtest[7] =   {'1', '6', '3', '8', '4', '\r', '\n'};
uint8_t once_ram = 0;

uint8_t z = 0;
uint8_t line_flag = 0;

//6502
#define RAM_SIZE 16384
uint8_t RAM[RAM_SIZE];

//6502 CPU registers
uint8_t sp, a, x, y, cpustatus;
uint16_t pc;

//helper variables
uint32_t instructions = 0; //keep track of total instructions executed
int32_t clockticks6502 = 0, clockgoal6502 = 0;
uint16_t oldpc, ea, reladdr, value, result;
uint8_t opcode, oldcpustatus, useaccum;

#define FLAG_CARRY     0x01
#define FLAG_ZERO      0x02
#define FLAG_INTERRUPT 0x04
#define FLAG_DECIMAL   0x08
#define FLAG_BREAK     0x10
#define FLAG_CONSTANT  0x20
#define FLAG_OVERFLOW  0x40
#define FLAG_SIGN      0x80

//flag calculation macros
#define zerocalc(n) { if ((n) & 0x00FF) clearzero(); else setzero(); }
#define signcalc(n) { if ((n) & 0x0080) setsign(); else clearsign(); }
#define carrycalc(n) { if ((n) & 0xFF00) setcarry(); else clearcarry(); }
#define overflowcalc(n, m, o) { if (((n) ^ (uint16_t)(m)) & ((n) ^ (o)) & 0x0080) setoverflow(); else clearoverflow(); }

//flag modifier macros
#define setcarry() cpustatus |= FLAG_CARRY
#define clearcarry() cpustatus &= (~FLAG_CARRY)
#define setzero() cpustatus |= FLAG_ZERO
#define clearzero() cpustatus &= (~FLAG_ZERO)
#define setinterrupt() cpustatus |= FLAG_INTERRUPT
#define clearinterrupt() cpustatus &= (~FLAG_INTERRUPT)
#define setdecimal() cpustatus |= FLAG_DECIMAL
#define cleardecimal() cpustatus &= (~FLAG_DECIMAL)
#define setoverflow() cpustatus |= FLAG_OVERFLOW
#define clearoverflow() cpustatus &= (~FLAG_OVERFLOW)
#define setsign() cpustatus |= FLAG_SIGN
#define clearsign() cpustatus &= (~FLAG_SIGN)

#define BASE_STACK     0x100

#define saveaccum(n) a = (uint8_t)((n) & 0x00FF)

#define setinterrupt() cpustatus |= FLAG_INTERRUPT

//serial var
uint8_t curkey = 'C';


char memtest[7] =   "16384\r\n";
char memtest2[20] = "10 FOR N = 1 TO 10\r\n";
char memtest3[19] = "20 FOR J = 1 TO N\r\n";
char memtest4[13] = "30 PRINT J;\r\n";
char memtest5[11] = "40 NEXT J\r\n";
char memtest6[10] = "50 PRINT\r\n";
char memtest7[11] = "60 NEXT N\r\n";
char memtest8[5] =  "RUN\r\n";


char benchline1[22] = "10 FOR N = 1 TO 10000\r\n";
char benchline2[11] = "20 NEXT N\r\n";
char benchline3[5] =  "RUN\r\n";

char benchV2line1[25] = "10 FOR I=0 TO 10000:NEXT\r\n";
char benchV2line2[5] =  "RUN\r\n";

int main(void)
{
	const unsigned char menu[] = " 6502 CPU emulator V0.1!\r\n";

	/* Enable USART1 and GPIOA clock */
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1 | RCC_APB2Periph_GPIOA, ENABLE);
	SetSysClockTo72();
	NVIC_Configuration();/* NVIC Configuration usart */
	GPIO_Configuration();/* Configure the GPIOs usart */
	USART_Configuration();/* Configure the USART1 */
	USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);/* Enable the USART1 Receive interrupt */

	/* print welcome information */
	UARTSend(menu, sizeof(menu));

	reset6502();

    while(1)
    {
    	exec6502(800);
    	if(line_flag == 1){ //ram
    		curkey = memtest[z];
    		z++;
    		//uint8_t strlengte = strlen(memtest) - 48;
    		if(z > 6){
				line_flag = 2;
				z = 0;
    		}
    	}
    	exec6502(800);
    	if(line_flag == 2){ //for
    		curkey = benchV2line1[z];
    		z++;
    		if(z > 24){
				line_flag = 3;
				z = 0;
    		}
    	}
    	exec6502(800);
    	if(line_flag == 3){ //run
    	    curkey = benchV2line2[z];
    	    z++;
			 if(z > 4){
				line_flag = 0;
				z = 0;
			 }
    	 }

/*
    	exec6502(300);
    	if(line_flag == 2){ //for
    		curkey = benchline1[z];
    		z++;
    		if(z > 21){
				line_flag = 3;
				z = 0;
    		}
    	}
    	exec6502(300);
    	if(line_flag == 3){ //print
    	    curkey = benchline2[z];
    	    z++;
			 if(z > 10){
				line_flag = 4;
				z = 0;
			 }
    	 }
    	exec6502(300);
    	if(line_flag == 4){ //run
    	    curkey = benchline3[z];
    	    z++;
			 if(z > 4){
				line_flag = 0;
				z = 0;
			 }
    	 }
*/
//////////////////

/*
    	///start program 10
    	exec6502(400);

    	if(line_flag == 2){
    		curkey = memtest2[z];
    		z++;
    		if(z > 19){
				line_flag = 3;
				z = 0;
    		}
    	}

    	exec6502(400);

    	if(line_flag == 3){
    		curkey = memtest3[z];
    		z++;
    		if(z > 18){
				line_flag = 4;
				z = 0;
    		}
    	}

    	exec6502(400);

    	if(line_flag == 4){
    	    curkey = memtest4[z];
    	    z++;
			 if(z > 12){
				line_flag = 5;
				z = 0;
			 }
    	 }

    	exec6502(400);

    	if(line_flag == 5){
    	    curkey = memtest5[z];
    	    z++;
			 if(z > 10){
				line_flag = 6;
				z = 0;
			 }
    	 }
    	exec6502(400);

    	if(line_flag == 6){
    	    curkey = memtest6[z];
    	    z++;
			 if(z > 9){
				line_flag = 7;
				z = 0;
			 }
    	 }
    	exec6502(400);

    	if(line_flag == 7){
    	    curkey = memtest7[z];
    	    z++;
			 if(z > 10){
				line_flag = 8;
				z = 0;
			 }
    	 }
    	exec6502(400);

    	if(line_flag == 8){ //run
    	    curkey = memtest8[z];
    	    z++;
			 if(z > 4){
				line_flag = 0;
				z = 0;
			 }
    	 }
*/
    	//print_RXbuf();

    }
}

void print_RXbuf(){

	if(strlen(name) > 1){
		if(strlen(name) > 2){

			curkey = name[a]  & 0x7F;
			//USART_SendData(USART1, curkey);// Last Version USART_SendData(USART1,(uint16_t) *pucBuffer++);
			//while(USART_GetFlagStatus(USART1, USART_FLAG_TC) == RESET)

			if(a >= strlen(name)){
				a = 0;
			}
			a++;
		}
		else{
			curkey = name[0]  & 0x7F;
			//USART_SendData(USART1, curkey);// Last Version USART_SendData(USART1,(uint16_t) *pucBuffer++);
			//while(USART_GetFlagStatus(USART1, USART_FLAG_TC) == RESET)

			name[0] = '\0';
			j = 0;
		}
	}
}

